<details><summary>Digger run report at 2023-10-13 12:35:22 (UTC)</summary>
                    <details><summary>Plan for <b>rimvydascivilis/alpha-infra#live_staging_data</b></summary>
  
```terraform
Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Using previously-installed hashicorp/aws v5.21.0

Terraform has been successfully initialized!
data.aws_availability_zones.available: Reading...
data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
Releasing state lock. This may take a few moments...

  ```
</details>

<details><summary>Terraform plan validation check (live_staging_data)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


<details><summary>Plan for <b>rimvydascivilis/alpha-infra#live_staging_ecr</b></summary>
  
```terraform
Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Using previously-installed hashicorp/aws v5.21.0

Terraform has been successfully initialized!
data.aws_partition.current: Reading...
data.aws_caller_identity.current: Reading...
aws_ecr_repository.this[0]: Refreshing state... [id=app-staging]
data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_caller_identity.current: Read complete after 0s [id=039454511521]
data.aws_iam_policy_document.repository[0]: Reading...
data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=1155861060]
aws_ecr_repository_policy.this[0]: Refreshing state... [id=app-staging]
aws_ecr_lifecycle_policy.this[0]: Refreshing state... [id=app-staging]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
Releasing state lock. This may take a few moments...

  ```
</details>


<details><summary>Terraform plan validation check (live_staging_ecr)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


<details><summary>Plan for <b>rimvydascivilis/alpha-infra#live_staging_eks</b></summary>
  
```terraform
data.aws_caller_identity.current: Reading...
module.kms.data.aws_partition.current: Reading...
module.kms.data.aws_caller_identity.current: Reading...
data.aws_partition.current: Reading...
module.eks_managed_node_group["general"].data.aws_partition.current: Reading...
aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/eks-staging/cluster]
aws_security_group.cluster[0]: Refreshing state... [id=sg-044f16c76d3782fcb]
module.eks_managed_node_group["general"].data.aws_caller_identity.current: Reading...
module.kms.data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_partition.current: Read complete after 0s [id=aws]
module.eks_managed_node_group["general"].data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks_managed_node_group["general"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks_managed_node_group["general"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
aws_security_group.node[0]: Refreshing state... [id=sg-073f0eb34900457c7]
data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
aws_iam_role.this[0]: Refreshing state... [id=eks-staging-cluster-20231013114406216600000001]
module.eks_managed_node_group["general"].aws_iam_role.this[0]: Refreshing state... [id=general-eks-node-group-20231013114406218900000003]
data.aws_caller_identity.current: Read complete after 0s [id=039454511521]
data.aws_iam_session_context.current: Reading...
data.aws_iam_session_context.current: Read complete after 0s [id=arn:aws:iam::039454511521:user/rimvydas]
module.kms.data.aws_caller_identity.current: Read complete after 0s [id=039454511521]
module.eks_managed_node_group["general"].data.aws_caller_identity.current: Read complete after 0s [id=039454511521]
aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-2634311641]
aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-4270708759]
aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-1482041025]
aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-962315318]
aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-1609955449]
aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-1022825738]
aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-799746347]
aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-3874049725]
aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-2472210277]
aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-2896772303]
aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-3447937206]
module.eks_managed_node_group["general"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=general-eks-node-group-20231013114406218900000003-20231013114408081400000007]
module.eks_managed_node_group["general"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=general-eks-node-group-20231013114406218900000003-20231013114408036800000006]
module.eks_managed_node_group["general"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=general-eks-node-group-20231013114406218900000003-20231013114407847600000005]
aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=eks-staging-cluster-20231013114406216600000001-20231013114408446300000008]
aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=eks-staging-cluster-20231013114406216600000001-20231013114408448900000009]
module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=3908358093]
module.kms.aws_kms_key.this[0]: Refreshing state... [id=cb43c7ab-6fba-48c1-8412-8704afe15168]
module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/eks-staging]
aws_eks_cluster.this[0]: Refreshing state... [id=eks-staging]
aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::039454511521:policy/eks-staging-cluster-ClusterEncryption2023101311443417330000000a]
aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=eks-staging-cluster-20231013114406216600000001-2023101311443478930000000b]
data.aws_eks_addon_version.this["coredns"]: Reading...
time_sleep.this[0]: Refreshing state... [id=2023-10-13T11:53:53Z]
data.tls_certificate.this[0]: Reading...
aws_ec2_tag.cluster_primary_security_group["Terraform"]: Refreshing state... [id=sg-0fc60012693b497ae,Terraform]
aws_ec2_tag.cluster_primary_security_group["Environment"]: Refreshing state... [id=sg-0fc60012693b497ae,Environment]
data.aws_eks_addon_version.this["kube-proxy"]: Reading...
data.aws_eks_addon_version.this["vpc-cni"]: Reading...
module.eks_managed_node_group["general"].aws_launch_template.this[0]: Refreshing state... [id=lt-08c198930bd9c71ac]
data.aws_eks_addon_version.this["vpc-cni"]: Read complete after 0s [id=vpc-cni]
data.aws_eks_addon_version.this["kube-proxy"]: Read complete after 0s [id=kube-proxy]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Refreshing state... [id=eks-staging:general-2023101311535584640000000e]
data.aws_eks_addon_version.this["coredns"]: Read complete after 0s [id=coredns]
data.tls_certificate.this[0]: Read complete after 0s [id=5933588ce34e24e9fb40c3565fb0b5993639df67]
aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::039454511521:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/59BD58F5B14FC713383F24F9B0EE3A63]
aws_eks_addon.this["coredns"]: Refreshing state... [id=eks-staging:coredns]
aws_eks_addon.this["kube-proxy"]: Refreshing state... [id=eks-staging:kube-proxy]
aws_eks_addon.this["vpc-cni"]: Refreshing state... [id=eks-staging:vpc-cni]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

Warning: Argument is deprecated

  with aws_eks_addon.this["vpc-cni"],
  on main.tf line 392, in resource "aws_eks_addon" "this":
 392:   resolve_conflicts        = try(each.value.resolve_conflicts, "OVERWRITE")

The "resolve_conflicts" attribute can't be set to "PRESERVE" on initial
resource creation. Use "resolve_conflicts_on_create" and/or
"resolve_conflicts_on_update" instead

(and 2 more similar warnings elsewhere)
Releasing state lock. This may take a few moments...

  ```
</details>


<details><summary>Terraform plan validation check (live_staging_eks)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


<details><summary>Plan for <b>rimvydascivilis/alpha-infra#live_staging_k8s-addons</b></summary>
  
```terraform
Terraform will perform the following actions:

  # aws_iam_policy.argocd_image_updater[0] will be created
  + resource "aws_iam_policy" "argocd_image_updater" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "eks-staging-argocd-image-updater"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:GetAuthorizationToken",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:GetRepositoryPolicy",
                          + "ecr:DescribeRepositories",
                          + "ecr:ListImages",
                          + "ecr:DescribeImages",
                          + "ecr:BatchGetImage",
                          + "ecr:GetLifecyclePolicy",
                          + "ecr:GetLifecyclePolicyPreview",
                          + "ecr:ListTagsForResource",
                          + "ecr:DescribeImageScanFindings",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role.argocd_image_updater[0] will be created
  + resource "aws_iam_role" "argocd_image_updater" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "oidc.eks.us-east-1.amazonaws.com/id/59BD58F5B14FC713383F24F9B0EE3A63:sub" = "system:serviceaccount:kube-system:argocd-image-updater"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::039454511521:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/59BD58F5B14FC713383F24F9B0EE3A63"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-staging-argocd-image-updater"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.argocd_image_updater[0] will be created
  + resource "aws_iam_role_policy_attachment" "argocd_image_updater" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "eks-staging-argocd-image-updater"
    }

  # helm_release.argocd_image_updater[0] will be created
  + resource "helm_release" "argocd_image_updater" {
      + atomic                     = false
      + chart                      = "argocd-image-updater"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "argocd-image-updater"
      + namespace                  = "argocd"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = (known after apply)
      + verify                     = false
      + version                    = "0.9.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

Plan: 4 to add, 0 to change, 0 to destroy.
Releasing state lock. This may take a few moments...

  ```
</details>


<details><summary>Terraform plan validation check (live_staging_k8s-addons)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


<details><summary>Plan for <b>rimvydascivilis/alpha-infra#live_staging_vpc</b></summary>
  
```terraform
Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Using previously-installed hashicorp/aws v5.21.0

Terraform has been successfully initialized!
aws_vpc.this[0]: Refreshing state... [id=vpc-02787dd14380096d0]
aws_route_table.intra[0]: Refreshing state... [id=rtb-00210cf139ab8b816]
aws_default_route_table.default[0]: Refreshing state... [id=rtb-00b1dd80bb5f5a5ca]
aws_default_network_acl.this[0]: Refreshing state... [id=acl-070d2ab5d4586d980]
aws_subnet.intra[2]: Refreshing state... [id=subnet-07d9ea370bfe74644]
aws_subnet.intra[0]: Refreshing state... [id=subnet-06411f0fbac7b713f]
aws_default_security_group.this[0]: Refreshing state... [id=sg-0d335e5c6101a1d46]
aws_subnet.public[2]: Refreshing state... [id=subnet-0213a1e92056659a1]
aws_subnet.intra[1]: Refreshing state... [id=subnet-0d4d0ff0f2e0236fa]
aws_subnet.public[0]: Refreshing state... [id=subnet-0222aa8bb754c5d31]
aws_subnet.public[1]: Refreshing state... [id=subnet-04578f066f122de24]
aws_subnet.private[0]: Refreshing state... [id=subnet-078ed00d5361747db]
aws_route_table.public[0]: Refreshing state... [id=rtb-092cdfa16c80090e1]
aws_subnet.private[1]: Refreshing state... [id=subnet-019be35d8bb9cfa73]
aws_subnet.private[2]: Refreshing state... [id=subnet-0a2dce1751ff6adcd]
aws_internet_gateway.this[0]: Refreshing state... [id=igw-03ceaa93f1356815d]
aws_route_table.private[0]: Refreshing state... [id=rtb-00b94f529aad8fc24]
aws_route_table_association.intra[0]: Refreshing state... [id=rtbassoc-028b6724f2ff0705c]
aws_route_table_association.intra[1]: Refreshing state... [id=rtbassoc-0a0d0e60852621b48]
aws_route_table_association.intra[2]: Refreshing state... [id=rtbassoc-0701feee500308be2]
aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-02c9dc912e6541dd2]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-01cdcc5a85e1dea2d]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-03b23a2ca33be8327]
aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0a6c89ffe3a60bdc2]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0b920c5d7742f7d88]
aws_eip.nat[0]: Refreshing state... [id=eipalloc-0d3132a2de77af2af]
aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-092cdfa16c80090e11080289494]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-05dd5a9ff23d3fee9]
aws_nat_gateway.this[0]: Refreshing state... [id=nat-01b2ddee7d8b40032]
aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-00b94f529aad8fc241080289494]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
Releasing state lock. This may take a few moments...

  ```
</details>


<details><summary>Terraform plan validation check (live_staging_vpc)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>

</details>